app/Http/Controllers/Admin/Api/ApiController.php

select * from `users` where `users`.`deleted_at` is null
---
    public function users()
    {
        // Retorno para usuários
        return User::all();

select * from `socios` where `nome` LIKE '%%' and `socios`.`deleted_at` is null
select * from `users` where `users`.`id` in (2, 3) and `users`.`deleted_at` is null
select * from `socios` where `nome` LIKE '%%' and `user_id` = 2 and `socios`.`deleted_at` is null
---
    public function partners(Request $request)
    {
        // Retorno para sócio
        if (\Auth::user()->category == 1) {
            $data = Socio::where('nome', 'LIKE', "%{$request->get('socio')}%")->with('operador')->get();
        } else {
            $data = Socio::where('nome', 'LIKE', "%{$request->get('socio')}%")->with('operador')->where('user_id', \Auth::user()->id)->get();

select * from `gerenciamentos` where `gerenciamentos`.`deleted_at` is null
select * from `socios` where `socios`.`id` in (4, 5) and `socios`.`deleted_at` is null
select * from `gerenciamentos` where `operador_id` = 3 and `gerenciamentos`.`deleted_at` is null
---
    public function occurrencies()
    {
        // Retorno para ocorrências

        if (\Auth::user()->category == 1) {
            $data = Gerenciamento::with('socio')->get();
        } else {
            $data = Gerenciamento::where('operador_id', \Auth::user()->id)->with('socio')->get();

select * from `socios` where `socios`.`deleted_at` is null
select * from `users` where `users`.`id` in (2) and `users`.`deleted_at` is null
select * from `socios` where `user_id` = 3 and `socios`.`deleted_at` is null
---
    public function partnersOperator()
    {
        // Retorno de sócios do operador
        #\Auth::user()->category == 1 ? $data = Socio::all() : $data = Socio::where('user_id', \Auth::user()->cat)->get();

        if (\Auth::user()->category == 1) {
            $data = Socio::with('operador')->get();
        } else {
            $data = Socio::where('user_id', \Auth::user()->id)->with('operador')->get();