app/Http/Controllers/Admin/AdminController.php

    public function index()
    {

        if (\Auth::user()->token != null) {
            $n = Notification::where('user_id', \Auth::user()->id)
                ->where('status', 0)
                ->whereDate('day_contact', now())
                ->get();
---
select * from `notifications` where `user_id` = 1 and `status` = 0 and date(`day_contact`) = '2019-01-29'