app/Http/Controllers/Admin/EmailController.php

    public function create()
    {
        $s = Socio::all();
---
select * from `socios` where `socios`.`deleted_at` is null