app/Http/Controllers/Admin/GerenciamentosController.php

    public function index()
    {
        if (\Auth::user()->category == 1) {
            $o = Gerenciamento::count();
        } else {
            $o = Gerenciamento::where('operador_id', \Auth::user()->id)->count();
---
select count(*) as aggregate from `gerenciamentos` where `operador_id` = 3 and `gerenciamentos`.`deleted_at` is null

    public function show($id)
    {
        try {
            $s = Socio::all();
            $o = Gerenciamento::find($id);
            $not = Notification::where('gerenciamento_id', $o->id)->first();
            $operador = User::find($o->operador_id);

            $m = Message::where('ocorrencia_id', $id)->paginate();
---
select * from `socios` where `socios`.`deleted_at` is null
select * from `messages` where `ocorrencia_id` = '11' and `messages`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `messages` where `ocorrencia_id` = '11' and `messages`.`deleted_at` is null