app/Http/Controllers/Admin/ImagesController.php

    public function index()
    {
        $images = Image::simplePaginate();
---
select * from `images`

    public function create()
    {
        $partners = Socio::all();
---
select * from `socios` where `socios`.`deleted_at` is null

    public function show($id)
    {
        $image = Image::findOrFail($id);
---
select * from `url_images` where `url_images`.`image_id` = 18 and `url_images`.`image_id` is not null

    public function destroy($id)
    {
        try {
            UrlImages::where('image_id', $id)->delete();
---
delete from `url_images` where `image_id` = '17'

    public function search(Request $request)
    {
        $partner = Socio::where('nome', 'LIKE', "%{$request->search}%")->first();

        if (empty($partner)) {
            return redirect()->back()->with('error', 'Nenhum sócio encontrado');
        }
        $images = Image::where('partner_id', $partner->id)->paginate();
---
select * from `socios` where `nome` LIKE '%vic%' and `socios`.`deleted_at` is null limit 1
select * from `images` where `partner_id` = 1 limit 15 offset 0
select count(*) as aggregate from `images` where `partner_id` = 1