app/Http/Controllers/Admin/SociosController.php

    public function index()
    {
        \Auth::user()->category == 1 ? $s = Socio::orderBy('id', 'desc')->paginate() : $s = Socio::orderBy('id', 'desc')->where('user_id', \Auth::user()->id)->paginate();
        $total = Socio::count();
        return view('admin.controle.socios.index')->with(['socios' => $s, 'total' => $total]);
---
select * from `socios` where `socios`.`deleted_at` is null order by `id` desc limit 15 offset 0
select count(*) as aggregate from `socios` where `socios`.`deleted_at` is null
select * from `socios` where `socios`.`deleted_at` is null

    public function create()
    {
        try {
            $o = User::where('category', 2)->get();
---
select * from `users` where `category` = 2 and `users`.`deleted_at` is null

    public function show($id)
    {
        try {
            $o = User::where('category', '2')->get();
---
select * from `users` where `category` = '2' and `users`.`deleted_at` is null

    public function update(Request $request, $id)
    {
        // Verifica a existência de mudanças no operador, caso haja ele atualiza todos as ocorrências (Gerenciamentos)
        Gerenciamento::where('operador_id', $request->antigo)->where('socio_id', $id)->update(['operador_id' => $request->user_id]);

        Socio::find($id)->update($request->all());
---
update `gerenciamentos` set `operador_id` = '3', `updated_at` = '2018-12-10 15:31:48' where `operador_id` = '2' and `socio_id` = '4' and `gerenciamentos`.`deleted_at` is null
update `socios` set `user_id` = '3', `updated_at` = '2018-12-10 15:31:48' where `id` = 4

    public function searchPartner(Request $request)
    {
        $result = Socio::where('nome', 'LIKE', "%{$request->get('socio')}%")
            ->with('operador')
            ->orWhere('titulo', 'LIKE', "%{$request->socio}%")
            ->paginate();
        $total = Socio::where('nome', 'LIKE', "%{$request->get('socio')}%")->count();
        return view('admin.controle.socios.index')->with(['socios' => $result, 'total' => $total]);
---
select count(*) as aggregate from `socios` where `nome` LIKE '%%' and `socios`.`deleted_at` is null
select * from `socios` where `nome` LIKE '%%' and `socios`.`deleted_at` is null limit 15 offset 0