app/Http/Controllers/Admin/SociosController.php

    public function searchPartner(Request $request)
    {
        $user = \Auth::user()->id;

        $result = Socio::where('nome', 'LIKE', "%{$request->get('socio')}%")
            ->with('operador')
            ->admin(\Auth::user())
            ->orWhere('titulo', 'LIKE', "%{$request->socio}%")
            ->paginate();
---
select * from `users` where `users`.`id` in (2, 3) and `users`.`deleted_at` is null