app/Http/Controllers/Admin/UsuariosController.php

    public function index()
    {
        $u = User::orderBy('id', 'desc')->paginate(); #lista
        $a = User::where('situacao', 0)->count(); #ativos
        $i = User::where('situacao', 1)->count(); # inativos
        $o = User::where('category', 2)->count(); #operador
        $t = User::all(); # todos
---
select * from `users` where `users`.`deleted_at` is null order by `id` desc limit 15 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `situacao` = 0 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `situacao` = 1 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `category` = 2 and `users`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null